
from .models import Subject, Chapter, Topic



পদার্থবিজ্ঞান ১ম পত্র:
ভৌতজগত ও পরিমাপ
ভেক্টর
গতিবিদ্যা
নিউটনিয়ান বলবিদ্যা
কাজ, ক্ষমতা, ও শক্তি
মহাকর্ষ ও অভিকর্ষ
পদার্থের গাঠনিক ধর্ম
পর্যায়বৃত্ত গতি
তরঙ্গ
আদর্শ গ্যাস ও গ্যাসের গতিতত্ত্ব




পদার্থবিজ্ঞান ২য় পত্র:
তাপগতিবিদ্যা
স্থির তড়িৎ
চল তড়িৎ
তড়িৎ প্রবাহের চৌম্বক ক্রিয়া ও চৌম্বকত্ব
তড়িৎচৌম্বকীয় আবেশ
জ্যামিতিক আলোকবিজ্ঞান
ভৌত আলোকবিজ্ঞান
আধুনিক পদার্থ বিজ্ঞান
পরমাণুর মডেল ও নিউক্লিয়ার পদার্থবিজ্ঞান
সেমিকন্ডাক্টর ও ইলেক্ট্রনিক্স
জ্যোতির্বিজ্ঞান






রসায়ন ১ম পত্র:
ল্যাবরেটরির নিরাপদ ব্যবহার
গুণগত রসায়ন
মৌলের পর্যায়বৃত্ত ধর্ম ও রাসায়নিক বন্ধন
রাসায়নিক পরিবর্তন
কর্মমুখী রসায়ন


রসায়ন ২য় পত্র:
পরিবেশ রসায়ন
জৈব যৌগ
পরিমাণগত রসায়ন
তড়িৎ রসায়ন
অর্থনৈতিক রসায়ন




জীববিজ্ঞান ১ম পত্র:
কোষ ও এর গঠন
কোষ বিভাজন
কোষ রসায়ন
অণুজীব
শৈবাল ও ছত্রাক
ব্রায়োফাইটা ও টেরিডোফাইটা
নগ্নবীজী ও আবৃতবীজী উদ্ভিদ
টিসু ও টিসুতন্ত্র
উদ্ভিদ শরীরতত্ত্ব
উদ্ভিদ প্রজনন
জীব প্রযুক্তি
বিস্তার ও সংরক্ষণ,জীবের পরিবেশ



জীববিজ্ঞান ১ম পত্র
প্রাণীর ভিন্নতা ও শ্রেণিবিন্যাস
প্রাণীর পরিচিতি
পরিপাক ও শোষণ
রক্ত সঞ্চালন
শ্বাসক্রিয়া শ্বসন
বর্জ্য নিষ্কাশন
চলন ও অঙ্গচালনা
সমন্বয় ও নিয়ন্ত্রণ
মানব জীবনের ধারাবাহিকতা
মানবদেহের প্রতিরক্ষা
জিনতত্ত্ব ও বিবর্তন
প্রাণীর আচরণ



উচ্চতর গণিত ১ম পত্র:
ম্যাট্রিক্স ও নির্ণায়ক
ভেক্টর
সরলরেখা
বৃত্ত
বিন্যাস ও সমাবেশ
ত্রিকোণমিতিক অনুপাত
সংযুক্ত ও যৌগিক কোণের ত্রিকোণমিতিক অনুপাত
ফাংশন ও ফাংশনের লেখচিত্র
অন্তরীকরণ
যোগজীকরণ


উচ্চতর গণিত ২য় পত্র:
বাস্তব সংখ্যা ও অসমতা
যোগাশ্রয়ী প্রোগ্রাম
জটিল সংখ্যা
বহুপদী ও বহুপদী সমীকরণ
দ্বিপদী বিস্তৃতি
কণিক
বিপরীত ত্রিকোণমিতিক ফাংশন ও ত্রিকোণমিতিক সমীকরণ
স্থিতিবিদ্যা
সমতলে বস্তুকণার গতি
বিস্তার পরিমাপ ও সম্ভাবনা



তথ্য ও যোগাযোগ প্রযুক্তি:
বিশ্ব ও বাংলাদেশ পরিচিতি
কমিউনিকেশন সিস্টেমস ও নেটওয়ার্কিং
সংখ্যা পদ্ধতি ও ডিজিটাল ডিভাইস
ওয়েব ডিজাইন পরিচিতি এবং এইচটিএমএল
প্রোগ্রামিং ভাষা
ডেটাবেজ ম্যানেজমেন্ট সিস্টেম
